pytan1 = input("ти йдеш до магазину ?: ")
так = 0
ні = 0
spysok_ = ["молоко","йогурт","морозиво","книга"]

if pytan1== "ні":
    print("чого це?")
    input("натисніть будь-яку клавішу шоб закрити програму: ")

elif pytan1== "так":
    print("ти прийшов до магазину")
    py_tan2 = input("показувати список?: ")

    if py_tan2== "ні":
        print("навіщо тоді йти до магазину?")
        input("натисніть будь-яку клавішу шоб закрити програму: ")
    elif py_tan2== "так":
        print(spysok_)
        py_tan3 = input("будеш брати усе?: ")

        if py_tan3== "так":
            print("ви взяли до корзини усе, можете йти до касси")
            input("ви купили усе і можете йти додому: ")
        elif py_tan3== "ні":
            one_produkt = input("що ти хочеш купити?: ")
            print("ти купив ",one_produkt ,)
            input("ти купив те що хотів можеш йти додому: ")