name = input("введіть ім'я: ")
kirill = 0
borya = 0
stepan = 0
lev = 0
sanya = 0
if name== "Kirill":
    print("розробник цієЇ програми. Фамілія: Зайченко; років: 11; день народження: 1 травня. ")
elif name== "Borya":
    print("фамілія: Тімофеєв; років: 10; день народження: 23 березня.")
elif name== "Stepan":
    print("фамілія:литвіченко ; років: 10; день народження: 30 квітень.")
elif name== "Lev":
    print("фамілія: Заболотюк; років: 11; день народження: 27  липня.")
elif name== "Sanya":
    print("фамілія: Корягін; років: 11; день народження: 16 квітня.")
else:
    print("таких друзів у мене нема.")
    
input("натисніть будь-яку клавішу шоб закрити програму")
